cleanli2/stm32/src/common.c
  USART_InitStructure.USART_BaudRate = 115200;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

  STM_COMInit(COM1, &USART_InitStructure);
  /* To achieve GPIO toggling maximum frequency, the following  sequence is mandatory. 
     You can monitor PD0 or PD2 on the scope to measure the output signal. 
     If you need to fine tune this frequency, you can add more GPIO set/reset 
     cycles to minimize more the infinite loop timing.
     This code needs to be compiled with high speed optimization option.  */

  //PB3 PB4 PA15 PA13 PA14 set to gpio instead of SWJ
  GPIO_PinRemapConfig(GPIO_Remap_SWJ_Disable, ENABLE);
  //Touch_Test();

  //72M/72=1M, 1us/count
  timer_init(10000-1, 72-1);

  GPIO_InitTypeDef GPIO_InitStructure;
  //led
#ifdef RTC_SOC
  RTC_Init();
#endif
#ifdef ALIENTEK_MINI
  lprintf_time("\n\n================ALIENTEK_MINI board start================\n");
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8|GPIO_Pin_15|GPIO_Pin_14|GPIO_Pin_13;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  GPIO_ResetBits(GPIOA,GPIO_Pin_8);
  GPIO_ResetBits(GPIOA,GPIO_Pin_13);

  RCC_APB2PeriphClockCmd(BEEP_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = BEEP_GPIO_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(BEEP_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(BEEP_GPIO_GROUP, BEEP_GPIO_PIN);

  RCC_APB2PeriphClockCmd(LED0_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = LED0_GPIO_PIN;
  GPIO_Init(LED0_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(LED0_GPIO_GROUP, LED0_GPIO_PIN);

  RCC_APB2PeriphClockCmd(LED1_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = LED1_GPIO_PIN;
  GPIO_Init(LED1_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(LED1_GPIO_GROUP, LED1_GPIO_PIN);
#elif defined SUNRISE
  lprintf_time("\n\n================SUNRISE board start================\n");
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

  /* Configure PD0 and PD2 in output pushpull mode */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15|GPIO_Pin_14|GPIO_Pin_13;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  GPIO_ResetBits(GPIOA,GPIO_Pin_15|GPIO_Pin_14|GPIO_Pin_13);

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

  /* Configure in output pushpull mode */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4|GPIO_Pin_0;//PB4 spi flash cs
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
  GPIO_ResetBits(GPIOC,GPIO_Pin_0);	
  GPIO_SetBits(GPIOC,GPIO_Pin_4);//spi flash cs =1

  RCC_APB2PeriphClockCmd(BEEP_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = BEEP_GPIO_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(BEEP_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(BEEP_GPIO_GROUP, BEEP_GPIO_PIN);
#else
  lprintf_time("\n\n================Hamer board start================\n");
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

  /* Configure PD0 and PD2 in output pushpull mode */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15|GPIO_Pin_14|GPIO_Pin_13;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  GPIO_ResetBits(GPIOA,GPIO_Pin_15|GPIO_Pin_14|GPIO_Pin_13);

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

  /* Configure PD0 and PD2 in output pushpull mode */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4|GPIO_Pin_0;//PB4 spi flash cs
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  GPIO_ResetBits(GPIOB,GPIO_Pin_0);	
  GPIO_SetBits(GPIOB,GPIO_Pin_4);//spi flash cs =1

  RCC_APB2PeriphClockCmd(BEEP_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = BEEP_GPIO_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(BEEP_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(BEEP_GPIO_GROUP, BEEP_GPIO_PIN);
#endif
  //led end

  //power off pin set low
  RCC_APB2PeriphClockCmd(POWEROFF_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = POWEROFF_GPIO_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(POWEROFF_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(POWEROFF_GPIO_GROUP, POWEROFF_GPIO_PIN);
  //power off pin end

  RCC_GetClocksFreq(&RCC_ClocksStatus);
  lprintf_time("Version %s%s\n", VERSION, GIT_SHA1);
  get_rtc_time(0);
  lprintf_time("%s\n", get_rtc_time(0));
  lprintf("clk %d %d %d %d %d Hz\n\r",
		  RCC_ClocksStatus.SYSCLK_Frequency,
		  RCC_ClocksStatus.HCLK_Frequency,
		  RCC_ClocksStatus.PCLK1_Frequency,
		  RCC_ClocksStatus.PCLK2_Frequency,
		  RCC_ClocksStatus.ADCCLK_Frequency);
  lprintf_time("lcd init\n");
  lcd_sueb_init(0);
  lprintf_time("lcd init done.\n");
  lprintf_time("SD init\n");
  SD_Init();
  lprintf_time("SD init done\n");
  //SD_LowLevel_Init();

  /*1us/timer_count, 10ms/timer_intrpt*/
  while (looptimes--)
  {
      led_flash(0x3, 100);
  }
  beep_by_timer_100(0);
  //while(1) run_cmd_interface();
#if 0
  ict=0;
  lcd_clr_window(0xf00f, 0, 0, 100, 100);
  lcd_clr_window(BLUE, 0, 100, 100, 200);
  lcd_clr_window(0xff0f, 0, 200, 100, 300);
  lcd_lprintf(5, 250, "PowerOff");
  lcd_clr_window(0xff, 0, 300, 100, 400);
  lcd_lprintf(5, 350, "Timer");

  //reboot to download mode
  lcd_clr_window(RED, 0, 400, 100, 480);
  lcd_lprintf(5, 450, "Download");

