cleanli2/stm32/src/common.c
  lcd_clr_window(0, 120, 760, 400, 780);
  lcd_clr_window(0xf0f, 120, 760, 163, 780);

  lcd_clr_window(GREEN, 40, 500, 440, 600);
  lcd_clr_window(0xf0f, 56, 500, 440, 600);
  LCD_DrawLine(71, 500, 71, 600);
  LCD_DrawLine(109, 500, 109, 600);//5min
  LCD_DrawLine(138, 500, 138, 600);//10min
  LCD_DrawLine(210, 500, 210, 600);//30min
  LCD_DrawLine(280, 500, 280, 600);//60min
  lcd_lprintf(60, 580, "0 hours 0 minutes 16 seconds");
  lcd_lprintf(68, 620, "1    5   10       30        60  mins");
  auto_time_alert_set(AUTO_TIME_ALERT_INC_MINS);
  {
      char*date = get_rtc_time(0);
      Show_Str(190, 700,0,0xffff,(uint8_t*)date,24,0);
      if(check_rtc_alert_and_clear()){
          my_repeat_timer(3, 300);
      }
  }
  while(1){
      static uint32_t no_touch_count = 0;
      uint16_t tx = 0, ty=0;
      if(ict==0){
          char*date = get_rtc_time(&g_cur_date);
          if(g_timer.running){//timer
              uint32_t timer_ran = time_diff_seconds(&g_cur_date, &g_timer.start);
              if(timer_ran>g_timer.seconds_len){
                  beep(800, 3000);
                  if(g_timer.to_repeat>1){
                      g_timer.to_repeat--;
                      g_timer.start = g_cur_date;
                      update_progress_indicator(&g_timer_repeat_pi,
                              g_timer.repeat - g_timer.to_repeat,
                              g_timer.repeat);
                  }
                  else{
                      g_timer.running = 0;
                      if(g_timer.timeout_poff){
                          power_off();
                      }
                  }
              }
              else{
                  update_progress_indicator(&g_timer_pi, timer_ran, g_timer.seconds_len);
              }
          }
          Show_Str(190, 700,0,0xffff,(uint8_t*)date,24,0);
          adc_test();
          lprintf("sys_us %U\n", get_system_us());;
      }
      if(ict++>600){
          ict = 0;
      }
      delay_ms(1);
      if(get_TP_point(&tx, &ty)){
          no_touch_count = 0;
          if(get_BL_value()<=DEFAULT_IDLE_BL){
              set_BL_value(DEFAULT_BL);
          }
          TP_Draw_Big_Point(tx,ty,BLACK);		//画图
          if(tx < 100 && ty < 480 && ty > 400){//single timer
              reboot_download();
          }
          if(tx < 100 && ty < 400 && ty > 300){//single timer
              my_repeat_timer(1, single_timer_len);
          }
          if(tx < 100 && ty < 300 && ty > 200){//poweroff
              power_off();
          }
          if(tx < 100 && ty < 200 && ty > 100){
              my_repeat_timer(3, 10);
              //beep(1000, 2000);
          }
          if(tx < 100 && ty < 100){
              my_repeat_timer(3, 300);
              //beep(1000, 2000);
          }
          if(tx < 400 && tx > 120 && ty < 780 && ty > 760){
              uint16_t lcd_brt;
              lcd_clr_window(0, 120, 760, 400, 780);
              lcd_clr_window(0xf0f, 120, 760, tx, 780);
              lcd_brt = (tx - 120)*100/280;
              set_BL_value(lcd_brt);
          }
          if(tx < 440 && tx > 40 && ty < 600 && ty > 500){
              if(!g_timer.running){
                  uint32_t h, m, s;
                  lcd_clr_window(GREEN, 40, 500, 440, 600);
                  lcd_clr_window(0xf0f, 40, 500, tx, 600);
                  LCD_DrawLine(71, 500, 71, 600);//11min
                  LCD_DrawLine(109, 500, 109, 600);//5min
                  LCD_DrawLine(138, 500, 138, 600);//10min
                  LCD_DrawLine(210, 500, 210, 600);//30min
                  LCD_DrawLine(280, 500, 280, 600);//60min
                  single_timer_len = (tx - 40)*(tx - 40)/16;
                  h = single_timer_len/3600;
                  m = (single_timer_len%3600)/60;
                  s = single_timer_len%60;
                  lcd_lprintf(60, 580, "%d hours %d minutes %d seconds", h, m, s);
              }
          }
      }
      if(con_is_recved() && (con_recv() == 'c')){
          run_cmd_interface();
      }
      if(!g_timer.running){
          if(no_touch_count>AUTO_POWER_OFF_COUNT){
              if((no_touch_count-AUTO_POWER_OFF_COUNT)%1000 == 0){
                  beep(1000-(no_touch_count-AUTO_POWER_OFF_COUNT)/100, 200);
              }
              if(no_touch_count-AUTO_POWER_OFF_COUNT>9000)power_off();
          }
      }
      if(no_touch_count++>AUTO_POWER_OFF_COUNT/5){
          if(((no_touch_count/2000)%10) == 0){
              if(get_BL_value() != DEFAULT_BL) set_BL_value(DEFAULT_BL);
          }
          else{
              if(get_BL_value() != DEFAULT_IDLE_BL) set_BL_value(DEFAULT_IDLE_BL);
          }
      }
  }
#endif
}

void soft_reset_system()
{
    lprintf_time("system reset\n");
    foce_save_log_func();
    set_BL_value(0);
    LCD_RESET();
    __disable_fault_irq();
    NVIC_SystemReset();
}

void reboot_download()
{
    lprintf_time("reboot download\n");
    GPIO_SetBits(GPIOA,GPIO_Pin_13);
    beep(100, 500);
    lprintf_time("reboot download\n");
    foce_save_log_func();
    soft_reset_system();
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  lprintf("Wrong parameters value: file %s on line %d\r\n", file, line);
  /* Infinite loop */
  while (1)
  {
  }
}

#endif

/************************util***********************/
uint sub_with_limit(uint a, uint b, uint limit)
{
    if(a >= b){
        return a - b;
    }
    else{
        return a + limit - b;
    }
}

uint add_with_limit(uint a, uint b, uint limit)
{
    uint ret = a + b;
    if(ret >= limit){
        ret -= limit;
    }
    return ret;
}

/*DAC code*/
static int global_sound_mode = SOUND_BEEP_MODE;
int get_sound_mode()
{
    return global_sound_mode;
}

#ifdef DAC_SUPPORT
static uint32_t dac_freq = 5500;//11k
void dac_set_freq(uint32_t freq)
{
    lprintf("set dac freq=%u cur=%u\n", freq, dac_freq);
    dac_freq = freq;
    beep_by_timer(dac_freq);//11k
}
void Dac1_Init(void)
{

	GPIO_InitTypeDef GPIO_InitStructure;
	DAC_InitTypeDef DAC_InitType;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE );	  //enable port A clk
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE );	  //enable DAC clk

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;				 //config port
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN; 		 //analog input
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	GPIO_SetBits(GPIOA,GPIO_Pin_4)	;//PA.4 output high

	DAC_InitType.DAC_Trigger=DAC_Trigger_None;	//no trigger
	DAC_InitType.DAC_WaveGeneration=DAC_WaveGeneration_None;//no wave
	DAC_InitType.DAC_LFSRUnmask_TriangleAmplitude=DAC_LFSRUnmask_Bit0;//mask ampitude
	DAC_InitType.DAC_OutputBuffer=DAC_OutputBuffer_Enable ;	//DAC1 output buf open, BOFF1=0
	DAC_Init(DAC_Channel_1,&DAC_InitType);	 //init DAC1

	DAC_Cmd(DAC_Channel_1, ENABLE);  //enable DAC1

	DAC_SetChannel1Data(DAC_Align_12b_R, 0);  //12bit right align

