cleanli2/stm32/src/common.c
    dac_set_freq(5500);//11k
    global_sound_mode = SOUND_DAC_MODE;
    lprintf("dac1 init done\n");
}

void Dac1_Set_Vol(u32 vol)
{
    //lprintf("set vol %X\n", vol&0xfff);
	DAC_SetChannel1Data(DAC_Align_12b_R,vol&0xFFF);
}

u16 sin_value[10]={
    0,
    711,
    1401,
    2048,
    2632,//40
    3137,
    3546,
    3849,//70
    4033,
    4095
};
#define SIN_SIZE (sizeof(sin_value)/sizeof(sin_value[0]))

u16 get_sin_value(u32 x, u32 n)
{
    u16 ret, total, index;
    u32 dx;
    u32 sin_size=sizeof(sin_value)/sizeof(sin_value[0]);
    total = n*(sin_size-1);
    while(x>total)x-=total;
    index = x / n;
    dx = x - index*n;
    ret = sin_value[index] + dx * (sin_value[index+1] - sin_value[index]) / n;
    return ret;
}

void Dac1_wave(u32 type, u32 para2)
{
    u32 va=0,i, n=para2, t_sbl;
    static u32 dac_data_ct=0;
    uint8_t *wd;
    //lprintf("dac1 wave type %d\n", type);
    switch(type){
        case 0:
            for(va=0;va<0x1000;va+=40){
                while(sound_pool_full());
                put_sound(va, 100);
            }
            break;
        case 1:
            for(i=0;i<4*n*(SIN_SIZE-1);i++){
                va=i;
                if(va<=(SIN_SIZE-1)*n){
                    va=get_sin_value(va, n)/2+2048;
                }
                else if(va<(SIN_SIZE-1)*n*2){
                    va=(get_sin_value(2*(SIN_SIZE-1)*n-va, n)/2+2048);
                }
                else if(va<(SIN_SIZE-1)*n*3){
                    va=(2048-get_sin_value(va-2*(SIN_SIZE-1)*n, n)/2);
                }
                else{
                    va=(2048-get_sin_value(4*(SIN_SIZE-1)*n-va, n)/2);
                }
                while(sound_pool_full());
                put_sound(va, 100);
            }
            break;
        case 2:
            for(va=0;va<pcm_wav_len;va++){
                while(sound_pool_full());
                put_sound(pcm_wav[va]<<4, 100);
            }
            break;
        case 3:
            t_sbl=get_sound_size();
            wd=(uint8_t*)para2;
            for(va=0;va<512;va++){
                while(sound_pool_full());
                put_sound(wd[va]<<4, 100);
            }
            if(0==t_sbl || dac_data_ct++>20){
                lprintf("S+%d\n", t_sbl);
                dac_data_ct=0;
            }
            //lprintf_to("S-%d\n", get_sound_size());
            break;
        default:
            break;
    }
}

void Dac1_DeInit(void)
{
	DAC_Cmd(DAC_Channel_1, DISABLE);
    DAC_DeInit();
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, DISABLE);
    beep_by_timer_100(0);
    global_sound_mode = SOUND_BEEP_MODE;
    lprintf("dac1 deinit done\n");
}
#endif
